/****************************************************/
/* VESA(1024*768*8bit) Graphics Library for TC 2.0  */
/* copyright (c) Black White, April 1, 2013.        */
/* email: iceman@zju.edu.cn                         */
/* This program is for teaching purpose only,       */
/* if you want to reference it, please keep         */
/* the above copyright information.                 */
/****************************************************/
#if 0
int  set_vesa_mode_1024x768x8bit(void);
int  display_8bit_bmp(char *filename);
void vesa_putpixel(int x, int y, byte color);
byte vesa_getpixel(int x, int y);
void vesa_line(int x1, int y1, int x2, int y2, byte color);
void vesa_putchar(int x, int y, byte color, char c);
void vesa_puts(int x, int y, byte color, char s[]);
#endif

#include <stdio.h>
#include <stdlib.h>
#include <bios.h>
#include <dos.h>
#include <mem.h>
#include <alloc.h>
typedef unsigned char byte;
typedef unsigned short int word;
typedef unsigned long int dword;
typedef struct
{
/* +000 */ char signature[4];
/* +004 */ word version;
/* +006 */ char far *oem_name_ptr;
/* +00A */ dword capability;
/* +00E */ word far *video_mode_ptr;
/* +012 */ word video_memory_blocks;
/* +014 */ word software_version;
/* +016 */ char far *vendor_name_ptr;
/* +01A */ char far *product_name;
/* +01E */ char far *product_revision;
/* +022 */ word vbe_version;
/* +024 */ word far *accelerated_video_mode_ptr;
/* +028 */ char reversed_for_vbe_implementation[0xD8];
/* +100 */ char oem_scratch_pad[0x100];
} VESA_INFO; /* total 0x200 bytes */

typedef struct
{
/* +00 */ word mode_attr;
/* +02 */ byte win_a_attr;
/* +03 */ byte win_b_attr;
/* +04 */ word win_granularity;
/* +06 */ word win_size;
/* +08 */ word win_a_seg;
/* +0A */ word win_b_seg;
/* +0C */ void (far *win_fun_ptr)(void);
/* +10 */ word bytes_per_line;
/* +12 */ word width_pixels;
/* +14 */ word height_pixels;
/* +16 */ byte char_width;
/* +17 */ byte char_height;
/* +18 */ byte planes;
/* +19 */ byte bits_per_pixel;
/* +1A */ byte banks;
/* +1B */ byte mem_model_type;
/* +1C */ byte bank_size;
/* +1D */ byte image_pages;
/* +1E */ byte zero_or_one;
/* +1F */ byte red_bits;
/* +20 */ byte red_bit_off;
/* +21 */ byte green_bits;
/* +22 */ byte green_bit_off;
/* +23 */ byte blue_bits;
/* +24 */ byte blue_bit_off;
/* +25 */ byte reserved_bits;
/* +26 */ byte reserved_bit_off;
/* +27 */ byte direct_color_mode_info;
/* +28 */ dword vbuf_phys_addr;
/* +2C */ dword off_screen_addr;
/* +30 */ word off_screen_mem_blocks;
/* +32 */ byte reserved[0xCE];
} MODE_INFO;

typedef struct
{
   byte blue;
   byte green;
   byte red;
   byte reserved;
} BMP_PALETTE;

void text(void); /* 切换显卡到文本模式 */
VESA_INFO * get_vesa_info(void);  /* 获取BIOS支持的VESA接口信息 */
int  get_mode_info(word mode, MODE_INFO far *mi); /* 获取mode模式号的VESA接口信息 */
int  set_vesa_mode(word mode); /* 切换显卡到VESA图像模式, 其中mode是模式号 */
int  set_vesa_mode_1024x768x8bit(void); /* 切换显卡到1024x768x256色VESA模式 */
void map_window(word win); /* 把内存地址A000:0000与显卡内存建立映射关系 */
                           /* 在1024*768*256色模式下, 每个点占用1个字节, 整个屏幕共
                              占用1024*768字节(超过A000:0000~A0000:FFFF对应的64K内存),
                              所以映射时需要分窗口, 每个窗口只能对应显卡中的部分内存,
                              其中win是窗口号.
                            */
int  map_window_by_interrupt(word win); /* 用中断方式映射显卡内存, 速度较慢 */
void vesa_putpixel(int x, int y, byte color); /* 画点 */
byte vesa_getpixel(int x, int y); /* 读点 */
